[
  {
    "id": "1r64fal",
    "title": "[MAotD] Award: Thermalist",
    "author": "benbever",
    "score": 13,
    "num_comments": 7,
    "created_utc": 1771231332.0,
    "selftext": "Today we look at the Award **Thermalist**; Most heat resource cubes.\n\nThermalist, in the promotional material called ‘Global Warmer’, and ‘Earthlike Temperatures’ in the prototype, is one of the original five Awards on the base game map. It’s also in the Milestones&amp;Awards expansion, and on the Hollandia map (Dutch Open 2025).\n\nDo you like saving up resources for this Award, or do you rather spend them on Temperature? Is this Award worth heat production when Temperature is (almost) maxed? Any good cards to swing this Award?\n\nIs this Award fun, or does it delay game end, like some people (hoarding stockpiles of heat) complain about?",
    "permalink": "/r/TerraformingMarsGame/comments/1r64fal/maotd_award_thermalist/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1r64fal/maotd_award_thermalist/",
    "comments": [
      {
        "author": "Agreeable_Hat",
        "score": 10,
        "body": "Much more likely to fund this if I'm on a strong engine with Mass Converter/Quantum/etc. than when terraforming. I can let the energy roll over and let it sit, knowing my engine is better so the opponent wants to end and cannot afford to let their heat sit. Then you can usually steal a few heat bumps at the end anyway, if you know the game is won that gen.\n\nCan be fun to unexpectedly flip with Optimal Aerobraking too.",
        "depth": 0
      },
      {
        "author": "Aerospider",
        "score": 9,
        "body": "Fun one. Really hard to judge how much it's worth fighting for.\n\nPlus, a lot of players think it's actually good for Helion and I enjoy taking advantage of that!",
        "depth": 0
      },
      {
        "author": "Agreeable_Hat",
        "score": 5,
        "body": "&gt; Plus, a lot of players think it's actually good for Helion and I enjoy taking advantage of that!\n\nYeah, this one is so true and a bit crazy! People defaulting to Thermalist as Helion is pretty bad unless you're in panic mode and have no other awards to contest",
        "depth": 1
      },
      {
        "author": "epistemole",
        "score": 2,
        "body": "I think it is good for Helion, though. They can much more precisely end up with exactly what they need and no more.",
        "depth": 1
      },
      {
        "author": "Chance_Breakfast4848",
        "score": 3,
        "body": "This is a funny one. Many people naively think it's good for a terraforming player, who developed a bunch of early heat prod to raise the temp. It's actually best for quantum extractor, mass converter, and similar, when you get huge amounts of energy on accident that you have no use for.\n\nThe key thing to realize is that it gives a second use for heat, which is to buy 5 points. A terraforming player already has a perfectly good use: to raise the temp. An engine that has no desire to raise temp will value heat as worthless normally, but with this award funded they can turn that heat into value, which can be very helpful to an engine.\n\nOf course if you have like 8 heat prod against an engine with no heat, it's still a fine fund once it's late enough that you're confident your opponent can't randomly get a big pile of energy in time.",
        "depth": 0
      },
      {
        "author": "terraformingearth",
        "score": 2,
        "body": "Not just heat production, but excess energy production ends up here as well.",
        "depth": 0
      },
      {
        "author": "cjeysen",
        "score": 2,
        "body": "Love it, I always become dumb af when this one is funded, and always keep heat production cards",
        "depth": 0
      }
    ]
  },
  {
    "id": "1r5bqym",
    "title": "[MAotD] Milestone: Terraformer",
    "author": "benbever",
    "score": 10,
    "num_comments": 6,
    "created_utc": 1771152611.0,
    "selftext": "Todays Milestone is Terraformer: Have a Terraform Rating of at least 35.\n\nTerraformer is one of the original 5 Milestones on the base game map (Tharsis). In 4 player games, it’s practically never claimed. With 42 Global TR to divide over 4 players, by the time one player has gained 15TR, the game is (almost) finished.\n\nPerhaps that’s why they changed Terraformer to 25TR in Turmoil (2019). However, with a bunch of Preludes giving 2 or 3 TR each, some players considered this too easy.\n\nFan made Milestone expansion Capstone set Terraformer to 30TR. The map Hollandia (Dutch Open 2025) also used Terraformer at 30TR.\n\nFinally, the official Milestones&amp;Awards expansion (2024) set Terraformer to 29TR.\n\nDo you like this Milestone? Do you often try to claim it? Is 29TR the “sweet spot” or should the value depend on number of players?",
    "permalink": "/r/TerraformingMarsGame/comments/1r5bqym/maotd_milestone_terraformer/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1r5bqym/maotd_milestone_terraformer/",
    "comments": [
      {
        "author": "rri75",
        "score": 6,
        "body": "One of the better milestones, a favorite of mine to pursue in base + prelude, and also in 2P. Pursuing it applies pressure onto other players, for them to lock the other available milestones - and some interesting drafts ingame.\n\nOn Tharsis it is contested as the third possible milestone after builder and gardener, on par with planner and mayor. tmstats gives it second place in that 'third milestone' bracket, with an obviously higher win rate, since 5 VP over that 35 TR is alot in a probably short game.\n\nThe balance in turmoil is good since you lose 1TR each generation, but the 25TR ceiling is too low, making it achievable Gen 1. 30 TR is fine.",
        "depth": 0
      },
      {
        "author": "Aerospider",
        "score": 5,
        "body": "Most satisfyingly won against UNMI in 2-player.",
        "depth": 0
      },
      {
        "author": "Agreeable_Hat",
        "score": 3,
        "body": "For 2p B+P Arena on Tharsis, this milestone has the highest Average Elo Gain and highest winrate by a significant margin. If you get to claim this, the game is probably fast enough (and/or the opponent is struggling on Milestones) that you're very likely to win with a strong terraforming setup\n\n[https://www.tfmstats.com/milestones](https://www.tfmstats.com/milestones)\n\nCompletely fine to scale the amount needed with player counts. Personally I think it's at a pretty solid spot for 2p Tharsis, even if it's not claimed as often as Gardener/Builder",
        "depth": 0
      },
      {
        "author": "Fektoer",
        "score": 8,
        "body": "It’s a bit deceiving because if you’re in a spot to claim this, you’re already doing very well. So ofc it’s going to have the highest average elo gain over something like Planner, which does nothing for your game.",
        "depth": 1
      },
      {
        "author": "Friendly-Clock3507",
        "score": 4,
        "body": "25 is too low, 35 too high.\nHuge Asteroid, Great Aquifer and UNMI Contractor are already S Tier preludes on Tharsis, do not reward them with a 25 TR Milestone.",
        "depth": 0
      },
      {
        "author": "Mitnichar",
        "score": 2,
        "body": "Good milestone , but doesn't guarantee win if the other player is engine builder and stall the game to eternity",
        "depth": 0
      }
    ]
  },
  {
    "id": "1r4w4g7",
    "title": "[MAotD] Award: Collector",
    "author": "benbever",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1771103674.0,
    "selftext": "Today we look at the Award **Collector**; Most (different) types of resources, both on your player board and on your cards. \n\nCollector is an Award on Amazonis Planitia (the large 5 player map) where it competes for your funding with other engine oriented Awards, like most cards played, Most Colonies+cities, and most Science+Space tags. Collector is also in the Milestones&amp;Awards expansion.\n\nDo you like funding this Award? Is it safe? Good to fund early? Fun on Amazonis Planitita, or other maps?\n\nThere are 6 standard resources, and they’re pretty easy to have on your board after final production. The 3 main card resources (animals, microbes, and floaters) are a bit harder. But this Award makes the cards that give rare resource types (science, asteroids, desease) a lot more important. Some cards even have a unique resource type. (How many resource types are there?)\n\nWould you keep a Director resource on Board of Directors for this?",
    "permalink": "/r/TerraformingMarsGame/comments/1r4w4g7/maotd_award_collector/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1r4w4g7/maotd_award_collector/",
    "comments": [
      {
        "author": "Reason-and-rhyme",
        "score": 4,
        "body": "security fleet ftw(????)",
        "depth": 0
      },
      {
        "author": "charliec247",
        "score": 3,
        "body": "This and Refugee Camps.",
        "depth": 1
      },
      {
        "author": "baldsoprano",
        "score": 3,
        "body": "This is fun one. Not particularly swingy. You should know by mid game if this worth funding",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 2,
        "body": "Never played with this. Would be funny if someone won with a search for life science.",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 2,
        "body": "I was thinking about this too. Finding a microbe tag can suddenly be worth 8VP.",
        "depth": 1
      }
    ]
  },
  {
    "id": "1r3x2w2",
    "title": "[MAotD] Milestone: Terran",
    "author": "benbever",
    "score": 6,
    "num_comments": 7,
    "created_utc": 1771007475.0,
    "selftext": "Last tag collection Award proved popular, so how about a tag collecting Milestone? \n\nTodays Milestone is **Terran**: 5 Earth tags in play. (Wild tags count.)\n\nTerran is a Milestone on Amazonis Planitia, the larger map with 10 more global TR for 5 players.\n\nDo you like tag collecting milestones? Is this Milestone good on Amazonis Planitia with its engine oriented Awards?\n\nTerran is included in the Milestones&amp;Awards expansion. \n\nIs Terran fun, or is it a “win more” Milestone, up for grabs for the Point Luna/Vitor player with Business Empire + UNMI Contractor?\n\nIs 5 a good number for Earth tags? The fan made Milestones expansion Capstone has it at 4 tags.",
    "permalink": "/r/TerraformingMarsGame/comments/1r3x2w2/maotd_milestone_terran/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1r3x2w2/maotd_milestone_terran/",
    "comments": [
      {
        "author": "saiaxd",
        "score": 10,
        "body": "Not a fan, it is a win more milestone earth cards are mostly great early and quite rare so unlike something like builder you need a lot of luck to draw into it",
        "depth": 0
      },
      {
        "author": "Reymen4",
        "score": 3,
        "body": "I might play to much base game for it to feel resonable for me to get 5 earth tags.",
        "depth": 0
      },
      {
        "author": "icehawk84",
        "score": 4,
        "body": "This is on the big map (Amazonis Planitia) where games are longer. So it's difficult by design.",
        "depth": 1
      },
      {
        "author": "nageyoyo",
        "score": 5,
        "body": "the buff luna needed",
        "depth": 0
      },
      {
        "author": "Blackgaze",
        "score": 1,
        "body": "does luna really?",
        "depth": 1
      },
      {
        "author": "nageyoyo",
        "score": 2,
        "body": "yes terrible corp /s",
        "depth": 2
      },
      {
        "author": "baldsoprano",
        "score": 3,
        "body": "if someone has played a bunch of Earth tags early you've probably already seen the game shift to a battle for second. Make it official with this milestone",
        "depth": 0
      }
    ]
  },
  {
    "id": "1r1w3zt",
    "title": "[MAotD] Award: Electrician",
    "author": "benbever",
    "score": 11,
    "num_comments": 6,
    "created_utc": 1770813038.0,
    "selftext": "Today we look at the Award Electrician; Most Power Tags. (Event cards and Wild tags don’t count.)\n\nElectrician is an Award on Terra Commeria. It’s the only tag collection award on this map. Electrician is included in the Milestones&amp;Awards expansion.\n\nDo you like tag collection Awards? There are 27 Power tags in the Base + Prelude game. 3 more on Preludes and 1 on Thorgate. Promos and expansions only add 7 Power tags. There’s only 1 in Venus, 1 in Colonies, none in Turmoil, and none in Prelude2 (excluding promos). Is this a safe Awards to claim early?",
    "permalink": "/r/TerraformingMarsGame/comments/1r1w3zt/maotd_award_electrician/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1r1w3zt/maotd_award_electrician/",
    "comments": [
      {
        "author": "baldsoprano",
        "score": 10,
        "body": "Finally, a reason to play Thorgate! (Though not really)",
        "depth": 0
      },
      {
        "author": "cjeysen",
        "score": 5,
        "body": "Well... It is interesting. Not the usual tag that you stack, so you can sometimes draft cheap science tag to get those sweet 5 pts for 8mc if you're quick enough. Usually opponent won't have much in hand to come back. \n\nI like it better than building, space or science tags",
        "depth": 0
      },
      {
        "author": "Reason-and-rhyme",
        "score": 7,
        "body": "watch out for the science guy playing solar wind power, quantum extractor, mass converter tho!",
        "depth": 1
      },
      {
        "author": "benbever",
        "score": 3,
        "body": "(I think you mean power tag instead of science tag)\n\nI sometimes stack 2 Power tags to play Power Supply Consortium, or maybe even Fusion Power, but that’s it.",
        "depth": 1
      },
      {
        "author": "cjeysen",
        "score": 2,
        "body": "Precisely :D",
        "depth": 2
      },
      {
        "author": "maybeMathProf",
        "score": 2,
        "body": "Someone will always fund this when our group plays on Terra Cimmeria. At least twice, the winner funded it with just a two tag lead and it's never swung.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qzhqnd",
    "title": "[MAotD] Milestone: Forester | 7 Feb 2026",
    "author": "benbever",
    "score": 4,
    "num_comments": 6,
    "created_utc": 1770577759.0,
    "selftext": "Todays Milestone is Forester: 3 Plant Production.\n\nForester is a Milestone on Terra Cimmeria. Do you like simple production Milestones like this? Is plant production good on Terra Cimmeria?\n\nForester is included in the Milestones&amp;Awards expansion, so you can play it on other maps and in combination with other Milestones and Awards.\n\nPlant production can be hard to find early game. Have you ever claimed this Milestone in generation 1?",
    "permalink": "/r/TerraformingMarsGame/comments/1qzhqnd/maotd_milestone_forester_7_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qzhqnd/maotd_milestone_forester_7_feb_2026/",
    "comments": [
      {
        "author": "cjeysen",
        "score": 9,
        "body": "Feels like 3 isn't enough, should be 4 imo",
        "depth": 0
      },
      {
        "author": "Legion4444",
        "score": 9,
        "body": "I feel like everytime I see this milestone out, someone somehow always gets Ecoline and a either prelude that gives 1 plant production or one of those relatively cheap early 1 plant production cards. It's always gone in the first generation.",
        "depth": 0
      },
      {
        "author": "baldsoprano",
        "score": 4,
        "body": "It's one of those milestones that can skew your selections and whole game strategy. However, if in larger player counts, if you can't claim this is in Gen 1, round 1, don't bother. Odds are somebody else will. ",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 2,
        "body": "One of the cheesiest milestones with preludes or Ecoline. In our playgroup, some buy a colony on Ganymede to get the last production and funding it.",
        "depth": 0
      },
      {
        "author": "thenewjuniorexecutiv",
        "score": 2,
        "body": "Just had my first (4P) game with it - I was P4 with Ecoline and a plant production prelude. P2 was Splice with two plant production from Preludes and pulled \\[Designed Microorganisms\\] with his first action. So his first action gave him the card he needed, but bought me the time to claim it.\n\n",
        "depth": 0
      },
      {
        "author": "AReallyGoodName",
        "score": 1,
        "body": "Card: **[Designed Microorganisms](https://ssimeonoff.github.io/cards-list#155)**\n\nCost: 16MC\n\nDescription: It must be -14 C or colder. Increase your Plant production 2 steps.\n\nTags: Microbe, Science",
        "depth": 1
      }
    ]
  },
  {
    "id": "1qyb6r1",
    "title": "[MAotD] Award: Suburbian | 6 Feb 2026",
    "author": "benbever",
    "score": 14,
    "num_comments": 5,
    "created_utc": 1770462732.0,
    "selftext": "Today we look at the Award **Suburbian**; Most tiles on areas along the edges of the map.\n\nSuburbian is an Award on Utopia Planitia. It has a bit of overlap with Metroplist (most  City tiles).\n\nSuburbian is in the Milestones&amp;Awards expansion, meaning it can be played on all maps. Even on maps where there’s little room for tiles at the edges, like Terra Cimmeria.\n\nDo you enjoy Awards that influence where you place tiles? Have you ever had a game with strong competition for this Award, where every edge spot counted?",
    "permalink": "/r/TerraformingMarsGame/comments/1qyb6r1/maotd_award_suburbian_6_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qyb6r1/maotd_award_suburbian_6_feb_2026/",
    "comments": [
      {
        "author": "baldsoprano",
        "score": 12,
        "body": "I like it game mechanic wise. Less swingy and empowers ground game. However, this one is a little goofier thematically than Polar Explorer, Estate Dealer, or Desert Settler.  I mean what exactly is the award celebrating? WOW that corporation really built up the edges of a circle on a sphere?",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 6,
        "body": "edges of a hexagon on an oblate spheroid ;)",
        "depth": 1
      },
      {
        "author": "cjeysen",
        "score": 10,
        "body": "I love those kind of awards. It isn't just \"boring\" most tags of something which is sometimes just not competitive. Those spots are limited and so really strategic. You can early choose to place tiles at weakers spots to plan for this award.",
        "depth": 0
      },
      {
        "author": "stealthradek",
        "score": 5,
        "body": "This one definitely changes the gameplay quite significantly. Love it.",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 4,
        "body": "I also think this is a fun award to compete for",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qxi6rl",
    "title": "[MAotD] Milestone: Manager | 5 Feb 2026",
    "author": "benbever",
    "score": 11,
    "num_comments": 5,
    "created_utc": 1770385946.0,
    "selftext": "Todays Milestone is **Manager**; 3 special tiles in play.\n\nManager is a Milestone on Utopia Planitia, where it competes with other Milestones that can be pretty hard to reach, like Pioneer (3 colonies), Trader (3 different card resources), Metallurgist (6 Steel+Titanium production), and  Researcher (4 Science tags). Manager can help with the Award Suburbian (most tiles along the border of the map).\n\nOn the neoprene map this Milestone is called Specialist.\n\nManager is not in the Milestones&amp;Awards expansion, so you can’t (officially) play it on other maps. Maybe this is because people who buy M&amp;A often also have a bunch of expansions and promos, and thus a much larger deck, with the special tile cards diluted, making this Milestone less obtainable.\n\nIn Base+Prelude there are 11 cards that place a special tile, out of 215 cards. 14 if you have the Big Box. That’s 5.12% or 6.51% (Big Box). Or 1 in 20 cards (1 in 15 Big Box).\n\nWith expansions and promos added, it’s 11 or 14 (Big Box) cards out of 421 cards. That’s only 2.61% or 1 in 38 cards (1 in 30 Big Box).\n\nGetting 3 out of only 11 cards from a large deck can be pretty rare. And it’s even harder to get this (before other Milestones are claimed) if you play without draft, or play 2 player (where you only see 7 cards per generation in draft).\n\nHave you ever claimed this Milestone? Do you enjoy a Milestone like this? Do you wish it was included in M&amp;A?",
    "permalink": "/r/TerraformingMarsGame/comments/1qxi6rl/maotd_milestone_manager_5_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qxi6rl/maotd_milestone_manager_5_feb_2026/",
    "comments": [
      {
        "author": "baldsoprano",
        "score": 5,
        "body": "never been able to land this one... special tiles are just too rare at this point in my all promo, all expansion deck glut. It's going to be a rare moment when the stars align to be quick enough to be relevant to Milestone chases. I would make it more accessible, maybe by saying 4 to 5 non-ocean tiles directly generated by project cards.",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 3,
        "body": "There are 40+ project cards that place a tile, and a bunch of Corporations and Preludes, so that would be more accessible. However, in a 4 player game it’d be very hard to keep track of how your opponents placed their tiles.\n\nLandshaper (1 special tile, 1 Greenery, 1 City) is in M&amp;A. That’s the closest one to Manager I think.",
        "depth": 1
      },
      {
        "author": "baldsoprano",
        "score": 2,
        "body": "I think with preludes like Project Eden I would limit it to only red, blue, and green cards. I think you would only need to keep track for a few generations before it was claimed as opposed to never",
        "depth": 2
      },
      {
        "author": "benbever",
        "score": 2,
        "body": "That’s more of a Project Eden problem. It’s the only prelude that places 2 non ocean tiles.\n\nAt ~39 value it’s way more OP than other preludes. And with Double Down it decides the game before it even starts. I’ve replaced it in my game with this version:\n\nhttps://www.reddit.com/r/TerraformingMarsGame/comments/1l2o80o/my_take_on_balancing_project_eden/\n\nThat version is worth ~52 (about the value of 2 preludes) minus 1 prelude. I added text that if you receive it outside of the prelude phase (like with Valley Trust or Board of Directors) you can discard it and draw another prelude.",
        "depth": 3
      },
      {
        "author": "maybeMathProf",
        "score": 2,
        "body": "I've gotten this with natural preserve, industrial center and...something else. Very lucky because the placements themselves got me some nice resources and set me up for suburban later on.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qvrvpa",
    "title": "[MAotD] Award: Landscaper | 4 Feb 2026",
    "author": "benbever",
    "score": 15,
    "num_comments": 5,
    "created_utc": 1770219665.0,
    "selftext": "Today we look at the Award **Landscaper**;\n\nVastitas Borealis map: Most connected tiles (count your largest group of tiles).\n\nLandscaper, not to be confused with the Milestone Landshaper, is an Award on Vastitas Borealis, where it has synergy with Geologist and Highlander. It’s also in Milestones&amp;Awards, so it can be played on any map. It seems pretty good if you also have a 3 tile Milestone like Mayor, Gardener, Geologist, Coastguard, Landshaper, Manager, or Polar Explorer.\n\nThe downside is of course that most of your tiles need to be connected. Do you enjoy a game mechanic like this? Have you ever had a game where you blocked an opponent from connecting his tiles?",
    "permalink": "/r/TerraformingMarsGame/comments/1qvrvpa/maotd_award_landscaper_4_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qvrvpa/maotd_award_landscaper_4_feb_2026/",
    "comments": [
      {
        "author": "Agreeable_Hat",
        "score": 8,
        "body": "This award is amazing. There are so many incredible possibilities and tricks you can pull off for it, especially with stuff like Mangrove/Protected Valley/Mohole Area. Putting a tile on an ocean to connect two big clumps of tiles can be huge and might completely surprise people\n\nIt also opens up crazy block plays\n\nVastitas is a great map, and this award is a substantial part of why that is.\n\n[One example from the Hodge Discord](https://imgur.com/a/d8lL372), from a [BGA game between StrandedKnight and Pkoo](https://boardgamearena.com/table?table=789582536)",
        "depth": 0
      },
      {
        "author": "AReallyGoodName",
        "score": 3,
        "body": "Vastistas in general has extremely contested awards and milestones with some crazy swings. I love that map. \n\nHighlander's another where Ganymede and phobo count and then there's the possibility of an artificial lake play that can completely swing it. \n\nI've seen one turn farmer milestone plays (viral enhancers+nitrogen reducing bacteria and add rather than convert that turn) completely swinging the milestone from 0 to hit.\n\nI've played strip mine at max O2 game end just to swing blacksmith and soletta's gone down way later than it should be playable for engineer.\n\nThe map just really opens the game to tons of unique plays and the milestone/award fights are downright chaos which is wonderful.",
        "depth": 1
      },
      {
        "author": "nageyoyo",
        "score": 4,
        "body": "Every time I fund this award I regret it, there are so many ways to fight and block it 🥹",
        "depth": 0
      },
      {
        "author": "charliec247",
        "score": 3,
        "body": "This award makes me feel like I'm playing Terra Mystica",
        "depth": 0
      },
      {
        "author": "Mitnichar",
        "score": 1,
        "body": "Good one for engine",
        "depth": 0
      }
    ]
  },
  {
    "id": "1quvywe",
    "title": "[MAotD] Milestone: Geologist | 3 Feb 2026",
    "author": "benbever",
    "score": 5,
    "num_comments": 6,
    "created_utc": 1770134829.0,
    "selftext": "Todays Milestone is **Geologist**; 3 tiles on, or adjacent to, volcanic areas.\n\nThis is a Milestone on Vastitas Borealis. A volcanic area has bold text on the game board. When you cover a volcanic area with a tile, the rules suggest placing a gold cube on it until this milestones is claimed. This is so you can still find the areas adjacent to the volcanic area.\n\nPersonally I’d add a gold cube to all (usually 4) volcanic areas until this or 3 other Milestones are claimed. They’re kinda hard to spot otherwise. Normally only the player with Lava Flows or Lava Tube Settlement is looking for these spots. But with Geologist, all players need to keep an eye on them and the areas adjacent to them.\n\nOn Vastitas Borealis Geologist competes with plant and space tags collecting Milestones, and with an energy/heat production Milestone and an animal/microbe resource Milestone. Do you like this tile placement Milestone, or do you rather go for the card related Milestones? On Vastitas Borealis Geologist does help with the Awards Landscaper (most connected tiles) and Highlander (most tiles NOT adjacent to oceans). Coincidentally all 4 volcanic areas are not next to an area reserved for ocean.\n\nGeologist was not on the original fanmade Vastitas Borealis map. It is however included in the Milestones&amp;Awards expansion, so you can play it on other maps. Except Hellas and Utopia Planitia because these don’t have volcanic areas. All other maps have 4 volcanic areas, except Amazonis Planitita which has 5. The Milestones&amp;Awards rulebook lacks the helpful tip about the gold cubes.\n\nSpeaking about those, especially when playing with the 3D tiles, gold cubes for volcanic areas feels a bit unthematic. Does anyone maybe know of a boardgame that can donate 4 or 5 very small 3D volcanoes to make the volcanic areas more noticable?",
    "permalink": "/r/TerraformingMarsGame/comments/1quvywe/maotd_milestone_geologist_3_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1quvywe/maotd_milestone_geologist_3_feb_2026/",
    "comments": [
      {
        "author": "Great_GW",
        "score": 5,
        "body": "Claimed it last game I played with [Research outpost], [Mining rights] and [Mining area]",
        "depth": 0
      },
      {
        "author": "AReallyGoodName",
        "score": 2,
        "body": "Card: **[Research Outpost](https://ssimeonoff.github.io/cards-list#020)**\n\nCost: 18MC\n\nDescription: Effect: When you play a card, you pay 1 MC less for it. Place a city tile NEXT TO NO OTHER TILE.\n\nTags: Building, City, Science\n\n----\n\nCard: **[Mining Rights](https://ssimeonoff.github.io/cards-list#067)**\n\nCost: 9MC\n\nDescription: Place this tile on an area with a steel or titanium placement bonus. Increase that production 1 step.\n\nTags: Building\n\n----\n\nCard: **[Mining Area](https://ssimeonoff.github.io/cards-list#064)**\n\nCost: 4MC\n\nDescription: Place this tile on an area with a steel or titanium placement bonus, adjacent to another of your tiles. Increase your production of that resource 1 step.\n\nTags: Building",
        "depth": 1
      },
      {
        "author": "baldsoprano",
        "score": 3,
        "body": "A solid little milestone, good synergy with a ground game or when you’ve got a good little collection of special tiles",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 3,
        "body": "If this was available on Elysium or Tharsis, this is a compelling award because some of those placement bonuses are real nice (like the three card one). I've never played on Vastitas Borealis and don't know what sort of goodies it provides.",
        "depth": 0
      },
      {
        "author": "slim_muchacho",
        "score": 4,
        "body": "You could use the Milestones and Awards expansion to play with Geologist on Elysium.",
        "depth": 1
      },
      {
        "author": "Reason-and-rhyme",
        "score": 1,
        "body": "The volcanoes themselves offer a) one card b) 1x steel, c) 2x steel, and d) 1x titanium. Nowhere near as compelling as elysium. Adjacent to the volcanic tiles there is a 2x card and another 1x card, the rest are one mineral or one plant or nothing.",
        "depth": 1
      }
    ]
  },
  {
    "id": "1qtpms3",
    "title": "[MAotD] Award: Contractor | 1 Feb 2026",
    "author": "benbever",
    "score": 12,
    "num_comments": 2,
    "created_utc": 1770021269.0,
    "selftext": "Today we look at the Award **Contractor**;\n\nHellas map: Most Building tags.\n\nContractor is an Award on Hellas, alongside its counterpart Space Baron (most Space tags).  Do you enjoy this Award on Hellas? Or is Hellas already too card (engine) centric with its non optimal oceans? Diversifier, Rim Settler and Tactician partly overlap, and can help with Contractor, Space Baron and Magnate, all tag/card related Milestones and Awards.\n\nIn some tournaments (4p), Hellas is removed from the mix in favour of other maps. It’s less liked, and engine games take longer. But maybe engine games and huge card tableaus is your favourite part of the game?\n\nContractor is also in the Milestones&amp;Awards expansion, so it’s playable on other maps and in other combinations of Milestones and Awards.\n\nDo you often fund Contractor? Early or late game? Do you enjoy competing for it? I find myself sometimes keeping cheap building tag cards middle/late game when Contractor has been funded or is likely to be funded.",
    "permalink": "/r/TerraformingMarsGame/comments/1qtpms3/maotd_award_contractor_1_feb_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qtpms3/maotd_award_contractor_1_feb_2026/",
    "comments": [
      {
        "author": "baldsoprano",
        "score": 5,
        "body": "I like these sort of awards better when playing online. The amount of game stopping tag counting can be annoying in person. But yeah, these are solid awards for the engine player, though less optimal on Hellas because the ground game is tougher and the number of steel related cards that are tiles. However, it’s the same uphill battle for everyone, so huzzah if you got Great Wall or Mining Guild",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 2,
        "body": "I like how the conventionality of this award (get the most tags) sort of contrasts with the cheesiness of the milestones (you can get rim settler with just a couple of preludes).",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qsuafa",
    "title": "[MAotD] Milestone: Polar Explorer | 31 Jan 2026",
    "author": "benbever",
    "score": 12,
    "num_comments": 6,
    "created_utc": 1769939202.0,
    "selftext": "Todays Milestone is **Polar Explorer**; Have 3 tiles on the 2 bottom rows.\n\nPolar Explorer is a map specific Milestone on Hellas. It’s not available on other maps or included in Milestones&amp;Awards.\n\nThe South Pole (bottom 2 rows) doesn’t offer plants and there’s only 1 spot with ocean adjacency. Instead it offers heat resources (thematically by releasing frozen carbon dioxide), titanium, a card, and most notably an ocean for 6mc. Normally an ocean is valued around 14mc, so this spot tends to be popular. The player who places a tile here is only 2 tiles away from Polar Explorer.\n\nIn my games, Polar Explorer tends to be heavily competed, with 2, sometimes 3, players going for it. Especially if people have special tiles. The area isn’t great for cities (Hellas doesn’t encourage ground game anyway). But that’s 4 player. Is Polar Explorer a thing in 2 player? Do you enjoy this Milestone?\n\nA note on the ocean placement bonus: the -6mc is not the cost for the ocean. The ocean and -6mc are both just mandatory effects that must be resolved after placing a tile there. This means that you can use the 2mc you get for placing the ocean next to another ocean to pay the 6mc. As Helion, you can place a tile there if you have 3mc left, and place the ocean on the spot with 3 heat, and pay the 6mc with 3mc and 3 heat. It also means that if you place a tile there when all oceans tiles are on the board, you still need to lose 6mc.",
    "permalink": "/r/TerraformingMarsGame/comments/1qsuafa/maotd_milestone_polar_explorer_31_jan_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qsuafa/maotd_milestone_polar_explorer_31_jan_2026/",
    "comments": [
      {
        "author": "cjeysen",
        "score": 6,
        "body": "Well I always try to take it if I get the ocean spot. If I don't I prefer placing my tiles elsewhere and skip the milestone since other bonus are weak on south of the map compared to north",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 3,
        "body": "In our 4-5 player group, this one will go fast if someone has a prelude that has some sort of placement (exp forest, early settlement, etc).",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 3,
        "body": "There aren’t that many tile placing preludes, but in combination with a tile placing Corporation like Tharsis or Philares you’re 2/3 there.",
        "depth": 1
      },
      {
        "author": "icehawk84",
        "score": 2,
        "body": "Not the best milestone, but sometimes it's all you got.",
        "depth": 0
      },
      {
        "author": "baldsoprano",
        "score": 2,
        "body": "If you’ve got special tiles that it can be fine, but it kinda sucks for a ground game post milestone",
        "depth": 0
      },
      {
        "author": "AReallyGoodName",
        "score": 2,
        "body": "It's a trap! \n\nHellas adds a generation or two compared to other maps and by the end game 5VP is simply not as valuable as it is on the shorter maps. Sure take it if you happen to have mining rights+area etc. but in general it's just not worth stretching too much on this map to take the milestones.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qrx7s6",
    "title": "[MAotD] Award: Celebrity | 30 Jan 2026",
    "author": "benbever",
    "score": 12,
    "num_comments": 5,
    "created_utc": 1769849124.0,
    "selftext": "Today we look at the Award **Celebrity**;\n\nElysium map: Most Cards in play (not events) with a cost of at least 20M€.\n\nthis Award is also in the Milestones&amp;Awards expansion.\n\nDo you often fund this Award? Do you enjoy competing for it? Do you fund this in generation 1 for 8mc right after playing Io Mining Industries when you’re Credicor or do you wait for the last chance at 20mc? Is this Award often tied?\n\nThere are 21 20M€+ cards out of 215 in the base+prelude game. But not all of them are great, and a bunch are only good very early game (production). There’s 1 more if you include New Holland as played in the Dutch Open at exactly 20M€.\n\nThere are 54 20M€+ cards in the deck with all promos and expansions. 4 from Prelude 2.",
    "permalink": "/r/TerraformingMarsGame/comments/1qrx7s6/maotd_award_celebrity_30_jan_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qrx7s6/maotd_award_celebrity_30_jan_2026/",
    "comments": [
      {
        "author": "Mitnichar",
        "score": 4,
        "body": "Great award for engine builder",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 4,
        "body": "Definitely won’t fund this one early, but if I have a solid lead and have a few more big cards in hand, I may buy the award with some security. The fact people have to spend over 20me per card makes it a bit harder to swing sneakily.",
        "depth": 0
      },
      {
        "author": "Agreeable_Hat",
        "score": 2,
        "body": "Or significantly less, if they have space discounts + titanium and play a bunch of joves or similar! But yeah, I agree, generally not super flippable in most games",
        "depth": 1
      },
      {
        "author": "baldsoprano",
        "score": 1,
        "body": "Elysium awards tend to be a little more predictable and therefore safer to fund early. This is no exception. If you’ve got 4 or so good 20+me playable cards and you dont see anyone else laying down similar cards this is worth the early dive. ",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 1,
        "body": "I like this award, especially if someone else funds it. It can be easy to tie for first or second place. In 4 player, first place often has 3 or 4 cards, second place 2 or 3.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qr07k8",
    "title": "[MAotD] Milestone: Specialist | 29 Jan 2026",
    "author": "benbever",
    "score": 13,
    "num_comments": 9,
    "created_utc": 1769762955.0,
    "selftext": "**\\[MAotD\\] Milestone: Specialist | 29 Jan 2026**\n\nTodays Milestone is **specialist**; Have at least 10 in production of any resource.\n\nSpecialist is an Award on the fan favourite map Elysium. Specialist competes with its antithesis Milestone Generalist, Ecologist, Legend, and the rarely claimed Tycoon.\n\nIs Specialist often claimed? Do you go for it from the start? Can you get it as your first action with just corporation + preludes? Is it -ever- something else than mc production?\n\nSpecialist is notably not in the Milestones &amp; Awards expansion. Instead it’s replaced with Milestones like Fundraiser (12 M€ production), Engineer (10 energy and heat production combined), Energizer (6 energy production), and Metallurgist (6 steel and titanium production combined).\n\nSpecialist is included in the fan made Milestones and Awards expansion Project Capstone, where it is changed to 6 production of 1 resource and excludes M€ production.",
    "permalink": "/r/TerraformingMarsGame/comments/1qr07k8/maotd_milestone_specialist_29_jan_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qr07k8/maotd_milestone_specialist_29_jan_2026/",
    "comments": [
      {
        "author": "ThainEshKelch",
        "score": 8,
        "body": "We often get it in 2p with money or heat production.",
        "depth": 0
      },
      {
        "author": "yolopukki567",
        "score": 6,
        "body": "I really like that they changed it up in the Award&amp;Milestone expansion. It really sucks when someone takes it gen 1 with Banks + Business empire. Like those preludes weren’t good enough already",
        "depth": 0
      },
      {
        "author": "Mitnichar",
        "score": 1,
        "body": "With leaves seems unrealistically",
        "depth": 1
      },
      {
        "author": "charliec247",
        "score": 1,
        "body": "An extremely snowbally milestone. You're basically steamrolling your opponent if you snag this super early.\n\nOn another note, I have claimed Specialist at least once for each resource. Has anyone else also achieved this?",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 2,
        "body": "Even with 10 titanium production? How? Saturn Systems/Point Luna + Galilean Mining + Lunar Mining?",
        "depth": 1
      },
      {
        "author": "charliec247",
        "score": 2,
        "body": "Pretty much. Don't rmb exact details because it was only once a long time ago (on BGA in case ppl want proof...go dig through my game logs). The stars had to align (opp developing slowly, me getting the right cards) for it to happen. Easily the hardest resource to claim Specialist with.",
        "depth": 2
      },
      {
        "author": "Arganog",
        "score": 1,
        "body": "That's crazy!!\n\nI've only ever seen it claimed with M€, Heat and Energy myself (although my anecdotal sample size is only ~ 10-20 games with this particular milestone)",
        "depth": 1
      },
      {
        "author": "charliec247",
        "score": 3,
        "body": "I got it with Steel with an aggressive Mining Guild ground game. For plants and titanium you need everything to go right to get it.",
        "depth": 2
      },
      {
        "author": "icehawk84",
        "score": 2,
        "body": "It's one of the easiest milestones to get across all maps. Relatively often, someone will just have it immediately in the opening.\n\nIt also makes openings like Business Empire + Allied Banks even more busted than they already were.\n\nGetting it with other resource types is rare, thoygh heat can happen, especially if Helion is in the game.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qp8ybu",
    "title": "[MAotD] Award: Miner | 28 Jan 2026",
    "author": "benbever",
    "score": 20,
    "num_comments": 14,
    "created_utc": 1769600075.0,
    "selftext": "Today we look at the Award Miner;\n\nTharsis map: Have the most steel and titanium resource cubes.\n\nMiner is an Award available to fund on the base game map, where it competes for your mc with Landlord, Banker, Scientist,and Thermalist.\n\nIs this Award often funded? Is it fun? Do you fund this early for 8mc or late game for 20mc? Is it often stolen in the last actions of the game?",
    "permalink": "/r/TerraformingMarsGame/comments/1qp8ybu/maotd_award_miner_28_jan_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qp8ybu/maotd_award_miner_28_jan_2026/",
    "comments": [
      {
        "author": "MoistDingleSack",
        "score": 13,
        "body": "Miner always felt weird to me since in order to win it you need to actively handicap yourself, those minerals can be super vital in the last gen of a close game so I personally stay away unless im absolutely sweeping it.",
        "depth": 0
      },
      {
        "author": "baldsoprano",
        "score": 5,
        "body": "I wouldn't call it a handicap because it affects everyone. Everyone has to decide, once funded, how much of their economy to hold back.",
        "depth": 1
      },
      {
        "author": "MoistDingleSack",
        "score": 3,
        "body": "Yes but youre paying 20mc to inflict this handicap on everyone, if you then lose the award youre down 20 mc and that's a 10 point swing in 2p.",
        "depth": 1
      },
      {
        "author": "RIAnker",
        "score": 3,
        "body": "This exactly. I did recently play a game where funding this for 20 was my final action of the game.",
        "depth": 1
      },
      {
        "author": "cjeysen",
        "score": 8,
        "body": "Risky to fund early ! I personally always try to steal awards that opponent funded. I don't know, I find it maybe too funny to commit to grab these sweet 10 pts difference in the next gen",
        "depth": 0
      },
      {
        "author": "snakelauncher",
        "score": 6,
        "body": "i don't know if it's normal but this time you didn't say that the award is also in M&amp;A (and so can be on other maps too). it's not that different on other maps but for example it can change for a Mining Guild since some maps have more or less \"accessible\" minerals spot to gain productions",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 4,
        "body": "I planned to take Milestones and Awards from the 7 official cardboard maps, the 7 official neoprene maps (a few are different), the fanmade maps that predated the official neoprene maps, other fanmade maps like Arabia Terra and Hollandia, the official Milestones and Awards expansion, and its fanmade precessors like Project Capstone.\n\nBut only mention them if they are different from the official cardboard maps.\n\nIn hindsight, it’s relevant information if a Milestone/Award made it into M&amp;A or not, so I’ll include that next time.\n\nAll maps (excluding Amazonis Planitia) have 6 to 10 areas with steel and 3 to 5 areas with titanium (Tharsis is the only one with 3). So thr difference isn’t that big. Some maps (like Hellas) don’t encourage ground game, instead steering to space/engine, which, in turn, makes Miner relevant again because production is worth a bit more. Despite having a lot of steel and titanium areas, I wouldn’t enjoy being Mining Guild on Hellas with expansions and promos much though, unless my start hand was filled with special tiles.",
        "depth": 1
      },
      {
        "author": "snakelauncher",
        "score": 2,
        "body": "&gt;All maps (excluding Amazonis Planitia) have 6 to 10 areas with steel and 3 to 5 areas with titanium (Tharsis is the only one with 3). So thr difference isn’t that big. Some maps (like Hellas) don’t encourage ground game, instead steering to space/engine, which, in turn, makes Miner relevant again because production is worth a bit more. Despite having a lot of steel and titanium areas, I wouldn’t enjoy being Mining Guild on Hellas with expansions and promos much though, unless my start hand was filled with special tiles.\n\nyeah globally it's not that different, another differences i was thinking when i was talking about Mining Guild between maps is that minerals spot on ocean reserved area may change, for example Utopia and Vastitas don't have ocean spot with minerals, most have 2 and Cimmeria have only one so things like great aquifer which can be very efficient for Mining Guild may be less interesting depending on the map",
        "depth": 2
      },
      {
        "author": "baldsoprano",
        "score": 4,
        "body": "Thanks for putting this together u/benbever ! Unless my mineral engine is pumping, this is a late-game fund",
        "depth": 0
      },
      {
        "author": "Reason-and-rhyme",
        "score": 4,
        "body": "boosts the draft priority of Mineral Deposit substantially.",
        "depth": 0
      },
      {
        "author": "maybeMathProf",
        "score": 3,
        "body": "I like it when my end game greenery places on a tile with minerals and puts me over the edge.",
        "depth": 0
      },
      {
        "author": "maria_birds3",
        "score": 2,
        "body": "fund it early or regret it later bro",
        "depth": 0
      },
      {
        "author": "guacamelee84",
        "score": 3,
        "body": "I mean most of all award I play it based on what I have vs what the opponents have and if there is a time in my match where I can make the observation that no other player will now catch up to my say Steel cards then I will make the call based on what an award cost is currently and probably go for it.\n\nI will also make a decision on my starting hand asw as initial drafts based on the matches awards and milestones. \n\nAnd if the pick of corps preludes and project cards line up for it let’s fkn go 😏✌️\n\nI’d say going for a space/titanium play I find imho really fun. Especially if your get to be pretty alone on it or best have space monopoly 😎🫡",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 2,
        "body": "I like Miner because it’s very competitive. Unless a player is Mining Guild, it’s usually a late fund. And even with Mining Guild, there can be competition for second place. Cards like Hired Raiders and Sabotage can swing 4 metal resources.\n\nHowever, sometimes the competition can be a bit much, leading to counting in the last generation and analysis paralysis. You have to count the steel and titanium resources AND production of 3 opponents, guess if they have a card that adds/removes metals, and check their plant production to calculate Greeneries for the final Greenery round, and check the board if they can place them on an area with steel AND guess if they can increase their/lower your plant production with their last cards.",
        "depth": 0
      }
    ]
  },
  {
    "id": "1qoq95a",
    "title": "[MAotD] Builder | 27 Jan 2026",
    "author": "benbever",
    "score": 26,
    "num_comments": 7,
    "created_utc": 1769547240.0,
    "selftext": "Welcome to a new series of Milestone/Award of the Day, where we look at all Milestones and Awards, one per day. Which ones are great, and which ones are rarely claimed? Are all of them balanced, fair, and fun? Feel free to share a good story where you won or horribly lost going for this specific Milestone.\n\nToday's Milestone is **Builder**;\n\nTharsis map: Have at least **8 Building tags in play**.\n\nM&amp;A: **7 Building tags.**\n\nBuilder is a Milestone on the base game map, where it competes with Terraformer, Gardener, Mayor and Planner. Do you often go for this Milestone? Do you plan for it from your start hand?\n\nIs Builder good in 2 player? How about 4 player? Is it still good with expansions and promos?\n\nWith the Milestones &amp; Awards expansion, Builder can be a Milestone on any map. Is it good on all maps or just on Tharsis? The designers lowered it to 7 Building tags. Was this a much needed adjustment?\n\n",
    "permalink": "/r/TerraformingMarsGame/comments/1qoq95a/maotd_builder_27_jan_2026/",
    "url": "https://reddit.com/r/TerraformingMarsGame/comments/1qoq95a/maotd_builder_27_jan_2026/",
    "comments": [
      {
        "author": "DDB-",
        "score": 14,
        "body": "On the base map and with fewer expansions, it is usually one of the three claimed because building tags are quite common. I find it is one of those that if I get some cheap building tags and have steel income, I will see if I can get this.\n\n\nGoing down to 7 with the milestones and awards content makes sense given the relative lack of building tags among expansions. With all expansions, it's not as strong, and because it requires quite a few cards to get to, it's not something you can necessarily rush while setting yourself up for long term success.\n\n\nSo overall I'd call it balanced and a reasonable milestone to pursue, but not something to dedicate your early game towards.",
        "depth": 0
      },
      {
        "author": "Great_GW",
        "score": 6,
        "body": "Awesome idea Benbever, thanks!",
        "depth": 0
      },
      {
        "author": "Cylindrical_Jester",
        "score": 4,
        "body": "When I'm playing the base game, this is a go to for me - especially with certain corporations. I typically will consciously go for this based on my corporation + starting hand. I feel this one is early really card draw dependent.  I haven't tried it as much with the expansions though.",
        "depth": 0
      },
      {
        "author": "Fredrick_18241",
        "score": 3,
        "body": "I like builder it’s very strong in base game. Try to get this and Mayor when playing on the original map",
        "depth": 0
      },
      {
        "author": "benbever",
        "score": 5,
        "body": "I usually go for this naturally, not from the start, unless I have 3 or more building tags from corporation+prelude. I usually play 4 player, where the 35TR Milestone isn’t realistic. Out of the other 4, Gardener and sometimes Planner are picked first, and then it’s a race for Builder and/or Mayor.\n\nI remember a tournament game (first round) where I didn’t have a Milestone yet, 2 were already claimed, and I was set to claim Builder. Then, a player in turn order before me, who had already played a bunch of dubious building cards, played Underground Detonations and claimed Builder. He then proceeded to get 4th place. It seems paying 17mc middle game for 5VP isn’t great. This milestone can be a newbie trap.",
        "depth": 0
      },
      {
        "author": "baldsoprano",
        "score": 3,
        "body": "Agreed, there's plent of more organic ways to pull this milestone. If the corps, preludes, and cards can get you 50-70% of the way there w/o having to make dumb plays, then it's good money.",
        "depth": 1
      },
      {
        "author": "giesecam",
        "score": 3,
        "body": "I like this a slightly sneakier way to snag a milestone on Tharsis. Everyone knows who is about to get cities or greeneries but they might not expect you to play 2-4 consecutive builder tags to streal the milestone. Makes it fun to draft cheap builder tags if that's what you need",
        "depth": 0
      }
    ]
  }
]